Revit 2024 API
RevitCommandId Members
The RevitCommandId type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RevitCommandId
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
LookupCommandId
 Looks up and retrieves the Revit command id with the given id string.
LookupPostableCommandId
 Looks up and retrieves the Revit command id with the given id string.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CanHaveBinding
 Indicates whether the command can be assigned a binding to an external add-in.
HasBinding
 Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Id
 The command id.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The command name.
See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace